# Powerful data structures for data analysis, time series, and statistics

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
labels = ['a', 'b', 'c']      #list
my_data = [10, 20, 30]
arr = np.array(my_data)       #array
d = {'a':10, 'b':20, 'c':30}  #dictionary

# Series

In [6]:
pd.Series(data= my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])  # usa is labelled index and 1 is data point and so on
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'India', 'Japan'])
ser2

USA        1
Germany    2
India      5
Japan      4
dtype: int64

In [13]:
ser1['USA']

1

In [14]:
ser3 = pd.Series(data = labels)

In [15]:
ser3[0]

'a'

In [16]:
ser1 + ser2   # didnt find a match so it put null(NaN) value, and others convert to float to retain all info possible

Germany    4.0
India      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

In [17]:
import numpy as np
import pandas as pd

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(101)

In [20]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])  # data, index, columns are the arguments, dataframe is a bunch of series that share the same index. 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [22]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
type(df['W'])

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df['new'] = df['W'] + df['Y']  #adds a new column 'new'
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.shape

(5, 5)

In [27]:
df.drop('new', axis=1) # (rows, column):- rows have axis = 0 & column has axis = 0, by default .drop is set to axis = 0, so we need to make it 1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop('E')  # for rows, default axis = 0 is already set so no need to pass axis

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [29]:
df  # can see that new and E are not gone, this is because pandas dont want u to loose information, so we do below

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df.drop('new', axis=1, inplace=True)  # inplace = True made the drop permanent
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.loc['C']  # selection row using location

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
df.iloc[2]  # using index for selecting

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [34]:
df.loc['B', 'Y']  # value at row B and column Y

-0.8480769834036315

In [35]:
df.loc[['A', 'B'], ['W', 'Y']] #subset return of the dataframe

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

conditional selection and multindex part of dataframe

In [36]:
import numpy as np
import pandas as pd

In [37]:
from numpy.random import randn

In [38]:
np.random.seed(101)

In [39]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [41]:
booldf = df>0

In [42]:
df[booldf]   # returns value for which is true and false for others

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [44]:
df[df['W']>0] #returns those rows which happen to be true, here C is false in W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df['W']>0]['X']  #grabbing the X part of above

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [46]:
 boolser = df['W']>0
 result = df[boolser]
 result[['Y', 'X']]        # same as df[df['W']>0][['Y','X']]   will use this

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [47]:
df[(df['W']>0) & (df['Y']>1)]  # use & instead of and, coz df[(df['W']>0) and (df['Y']>1)] will throw an error, coz one side returns set of true false not just one true false

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df[(df['W']>0) | (df['Y']>1)]   # use | instead of or to avoid error # multiple conditons pass in parenthesis

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [50]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [51]:
df['cities'] = newind
df

          W         X         Y         Z cities
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [52]:
df.set_index('cities') # these both set and rest are not inplace by default so the changes are not permanent

               W         X         Y         Z
cities
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

multi index and index heirarchy

In [53]:
import numpy as np
import pandas as pd

In [54]:
# Index Levels
outside = ['G1', 'G1', 'G1','G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [56]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B']) # creating multi index dataframe; G1, G2 one level then inside them 1 2 3 & 1 2 3 another level of indexing
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [57]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [58]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [59]:
df.index.names  # the 2 indices are unnamed currently

FrozenList([None, None])

In [60]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [61]:
df.loc['G2'].loc[2]['B']  # more used thing # or df.loc['G2'].loc[2, 'B'] , to grab value from G2 -> 2 -> B

0.07295967531703869

In [62]:
df.xs(1, level='Num')  #less used #helps us to grab a cross section easily, which would be tricky with .loc

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

Missing Data

In [63]:
import numpy as np
import pandas as pd

In [64]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}  # dictionary
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.dropna()  # will drop the rows having nan values, default axis is 0

     A    B  C
0  1.0  5.0  1

In [66]:
df.dropna(axis=1) # drops the column having any nan

   C
0  1
1  2
2  3

In [67]:
df.dropna(thresh=2) # sets threshold = 2 hence drops those rows that have >=2 nan

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [68]:
df.fillna(value='WHATEVERY U WANT TO FILL WITH')

                               A                              B  C
0                              1                              5  1
1                              2  WHATEVERY U WANT TO FILL WITH  2
2  WHATEVERY U WANT TO FILL WITH  WHATEVERY U WANT TO FILL WITH  3

In [69]:
df['A'].fillna(value=df['A'].mean())  # na(nan) is filled by mean of 'A'

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Groupby

In [70]:
import numpy as np
import pandas as pd

In [71]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Shashwat'],
        'Sales': [200, 120, 340, 124, 243, 350]}
        
df = pd.DataFrame(data)
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Amy    340
3    MSFT   Vanessa    124
4      FB      Carl    243
5      FB  Shashwat    350

In [72]:
byCompany = df.groupby('Company')
byCompany.mean()  #mean cannot be found of the person column coz its a string

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [73]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [74]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [75]:
df.groupby('Company').sum().loc['FB'] #all the same thing in 1 line

Sales    593
Name: FB, dtype: int64

In [76]:
byCompany.std() #standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [77]:
df.groupby('Company').count() # returns the no of instances

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [78]:
df.groupby('Company').max()  # for string python is able to sort in alphabet order

           Person  Sales
Company
FB       Shashwat    350
GOOG          Sam    200
MSFT      Vanessa    340

In [79]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [80]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [81]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## merging, joining, concatenating DataFrames, study this from the jupyter notebook of the udemy course

## PANDAS OPERATIONS

In [82]:
import numpy as np
import pandas as pd

In [83]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444, 555, 666, 444],
                   'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
df['col2'].unique()  # finds all the unique values in column two

array([444, 555, 666], dtype=int64)

In [85]:
df['col2'].nunique()  # same as len(df['col2'].unique())  returns count of unique values

3

In [86]:
df['col2'].value_counts() # how many times each unique value appeared in the column

444    2
555    1
666    1
Name: col2, dtype: int64

In [87]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [88]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [89]:
def times2(x):
    return x*2

In [90]:
df['col1'].apply(times2)  # we used default functions like sum(), here is how we use our custom functions

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [91]:
df['col2'].apply(lambda x: x*3) # lambda func is helpful when u want to use this once

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [92]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [93]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [94]:
df.sort_values('col2') #df.sort_values(by='col2') same thingy

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [95]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [96]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': ['x', 'y', 'x', 'y', 'x', 'y'],
        'D': [1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [97]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# data input and output

## Installed libraries: sqlalchemy, lxml, html5lib, BeautifulSoup4

## CSV
## EXCEL    
## HTML
## SQl

## in this course we will be only dealing with csv, others are for knowledge

In [112]:
import pandas as pd

In [113]:
pwd  # need to have csv file in same folder

'c:\\Users\\Shashwat Gupta\\Desktop\\Data-science-and-machine-learning\\Pandas'

In [118]:
pd.read_csv('example')   #reading a csv file

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [119]:
df = pd.read_csv('example')
df.to_csv('My_output', index = False) # when we are saving our csv file, it is good to say index = false, otherwise it will assign its own unnamed index
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [121]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')  # pandas can only import data not things like images, formulas, macros etc

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [136]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [139]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
data

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [140]:
type(data)

list

In [141]:
from sqlalchemy import create_engine

In [142]:
engine = create_engine('sqlite:///:memory:')   # very small and temporary sql lite engine database is created in memory

In [143]:
df.to_sql('my_table', engine)
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15